[  
    {
        "url": "https://www.wsj.com/news/tech/future-of-everything?mod=nav_top_subsection",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "timestamp_start": "22_51_13_15_02_2022",
        "timestamp_end": "null",
        "title_from_source": "null",
        "title_from_page": "The Future of Everything: A Look Ahead from The Wall Street Journal.",
        "full_text": "The Future of Everything | WorkPeople in their 60s, 70s and beyond still want stimulating jobs. Researchers and workplace experts are figuring out what late-in-life careers could look like.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 13:51:22"
    },
    {
        "url": "https://www.wsj.com/news/heard-on-the-street?mod=nav_top_subsection",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "timestamp_start": "31_51_13_15_02_2022",
        "timestamp_end": "null",
        "title_from_source": "null",
        "title_from_page": "Heard on the Street",
        "full_text": "Heard on the StreetAs investors cool on big tech, they are warming to some faded stars of the dot-com era: telecommunications companies such as London-listed Vodafone. The bet has legs, particularly if European politicians decide that 5G networks are a higher priority than discount phone packages.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 13:51:31"
    },
    {
        "url": "https://www.wsj.com/market-data/mutualfunds-etfs?mod=nav_top_subsection",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "timestamp_start": "41_51_13_15_02_2022",
        "timestamp_end": "null",
        "title_from_source": "null",
        "title_from_page": "Mutual Funds & ETFs",
        "full_text": "Stocks: Real-time U.S. stock quotes reflect trades reported through Nasdaq only; comprehensive quotes and volume reflect trading in all markets and are delayed at least 15 minutes. International stock quotes are delayed as per exchange requirements. Fundamental company data and analyst estimates provided by FactSet. Copyright 2019© FactSet Research Systems Inc. All rights reserved. Source: FactSetIndexes: Index quotes may be real-time or delayed as per exchange requirements; refer to time stamps for information on any delays. Source: FactSetMarkets Diary: Data on U.S. Overview page represent trading in all U.S. markets and updates until 8 p.m. See Closing Diaries table for 4 p.m. closing data. Sources: FactSet, Dow JonesStock Movers: Gainers, decliners and most actives market activity tables are a combination of NYSE, Nasdaq, NYSE American and NYSE Arca listings. Sources: FactSet, Dow JonesETF Movers: Includes ETFs & ETNs with volume of at least 50,000. Sources: FactSet, Dow JonesBonds: Bond quotes are updated in real-time. Sources: FactSet, Tullett PrebonCurrencies: Currency quotes are updated in real-time. Sources: FactSet, Tullett PrebonCommodities & Futures: Futures prices are delayed at least 10 minutes as per exchange requirements. Change value during the period between open outcry settle and the commencement of the next day's trading is calculated as the difference between the last trade and the prior day's settle. Change value during other periods is calculated as the difference between the last trade and the most recent settle. Source: FactSetData are provided 'as is' for informational purposes only and are not intended for trading purposes. FactSet (a) does not make any express or implied warranties of any kind regarding the data, including, without limitation, any warranty of merchantability or fitness for a particular purpose or use; and (b) shall not be liable for any errors, incompleteness, interruption or delay, action taken in reliance on any data, or for any damages resulting therefrom. Data may be intentionally delayed pursuant to supplier requirements.Mutual Funds & ETFs: All of the mutual fund and ETF information contained in this display, with the exception of the current price and price history, was supplied by Lipper, A Refinitiv Company, subject to the following: Copyright 2019© Refinitiv. All rights reserved. Any copying, republication or redistribution of Lipper content, including by caching, framing or similar means, is expressly prohibited without the prior written consent of Lipper. Lipper shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon.Cryptocurrencies: Cryptocurrency quotes are updated in real-time. Sources: CoinDesk (Bitcoin), Kraken (all other cryptocurrencies)Calendars and Economy: 'Actual' numbers are added to the table after economic reports are released. Source: Kantar Media",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 13:51:41"
    },
    {
        "url": "https://www.wsj.com/podcasts/latest/wsj-your-money-matters?mod=nav_top_subsection",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "timestamp_start": "49_51_13_15_02_2022",
        "timestamp_end": "null",
        "title_from_source": "null",
        "title_from_page": "Your Money Briefing",
        "full_text": "J.R. Whalen is host and producer of The Wall Street Journal’s Your Money Briefing and Minute Briefing podcasts. He joined WSJ Podcasts in 2017 after nearly a decade of producing news and business programming for the WSJ’s video department. Before joining the WSJ, J.R. held positions at CBS News, CBS Sports, HBO, the Associated Press and Who Wants to Be a Millionaire, where he was responsible for assigning dollar values to the questions. He began his career at WVIP-AM/FM in Mount Kisco, N.Y., as news and sports director. He is a graduate of Syracuse University, and owns about 100 pairs of cufflinks.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 13:51:49"
    },
    {
        "url": "https://www.wsj.com/podcasts/latest/wsj-secrets-of-wealthy-women?mod=nav_top_subsection",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "timestamp_start": "57_51_13_15_02_2022",
        "timestamp_end": "null",
        "title_from_source": "null",
        "title_from_page": "Secrets of Wealthy Women",
        "full_text": "Your Money BriefingYour Money Briefing is your personal-finance and career checklist, with the news that affects your money and what you do with it. From spending and saving to investing and taxes, the Wall Street Journal’s finance reporters and experts break down complicated money questions every weekday to help you make better decisions about managing your money. Hosted by J.R. Whalen.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 13:51:57"
    },
    {
        "url": "https://www.wsj.com/news/tech/future-of-everything?mod=nav_top_subsection",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "The Future of Everything: A Look Ahead from The Wall Street Journal.",
        "full_text": "self.full_text",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 13:56:21"
    },
    {
        "url": "https://www.wsj.com/news/heard-on-the-street?mod=nav_top_subsection",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Heard on the Street",
        "full_text": "self.full_text",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 13:56:30"
    },
    {
        "url": "https://www.wsj.com/news/tech/future-of-everything?mod=nav_top_subsection",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "The Future of Everything: A Look Ahead from The Wall Street Journal.",
        "full_text": "The Future of Everything | WorkPeople in their 60s, 70s and beyond still want stimulating jobs. Researchers and workplace experts are figuring out what late-in-life careers could look like.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:04:03"
    },
    {
        "url": "https://www.wsj.com/podcasts/latest/wsj-secrets-of-wealthy-women?mod=nav_top_subsection",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Secrets of Wealthy Women",
        "full_text": "Your Money BriefingYour Money Briefing is your personal-finance and career checklist, with the news that affects your money and what you do with it. From spending and saving to investing and taxes, the Wall Street Journal’s finance reporters and experts break down complicated money questions every weekday to help you make better decisions about managing your money. Hosted by J.R. Whalen.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:04:12"
    },
    {
        "url": "https://www.wsj.com/news/types/letters?mod=nav_top_subsection",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "News, Articles, Biography, Photos",
        "full_text": "Why Kamila Valieva, the Russian Skater at the Center of the Olympic Doping Case, Is Allowed to Compete",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:04:21"
    },
   
    {
        "url": "https://www.wsj.com/articles/west-steps-up-diplomatic-efforts-to-avert-russian-attack-on-ukraine-11644841979?mod=hp_lead_pos1",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Russia Accelerates Troop Buildup Along Ukraine Border",
        "full_text": "Russia moved ahead with its massive military buildup near Ukraine, as German Chancellor Olaf Scholz began shuttling between the two nations seeking to stave off a conflict, and Moscow left the door open for talks.U.S. officials said that the Russian forces near Ukraine had grown to 105 battalion tactical groups, up from 83 groups earlier this month. Russia has also moved about 500 combat aircraft within range of Ukraine and has 40 combat ships in the Black Sea, said U.S. officials familiar with intelligence reports.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:04:47"
    },
    {
        "url": "https://www.wsj.com/articles/russias-parliament-to-weigh-recognition-of-breakaway-ukraine-regions-11644868385",
        "url_source": "https://www.wsj.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Russia’s Parliament to Weigh Recognition of Breakaway Ukraine Regions",
        "full_text": "MOSCOW—Russian legislators will Tuesday consider proposals urging President Vladimir Putin to formally recognize the separatist-controlled regions of eastern Ukraine as independent states, in a move that could justify Moscow’s incursion into an area it no longer considers to be Ukrainian territory.The State Duma, Russia’s lower house of parliament, said Monday it would consider draft resolutions submitted by the ruling United Russia party and Russia’s Communist Party calling on Mr. Putin to acknowledge the sovereignty of the self-proclaimed republics of Donetsk and Luhansk in Ukraine’s Donbas region.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:05:03"
    },
    {
        "url": "https://eu.usatoday.com/story/news/politics/2022/02/14/ukraine-us-sanctions-russia/6777935001/",
        "url_source": "https://eu.usatoday.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Biden threatens devastating sanctions if Russia invades Ukraine. Here's what that might look like.",
        "full_text": "Biden threatens devastating sanctions if Russia invades Ukraine. Here's what that might look like.Show Caption Hide Caption Ukraine-Russia tensions: Why concerns of a Russian invasion are high Tens of thousands of Russian troops are at the Ukraine border, leading to fears of an invasion. Here's what we know. Just the FAQs, USA TODAYWASHINGTON – President Joe Biden vows that Russia will face “swift and severe costs” if Russia invades Ukraine, but following through on that threat will require a tough balancing act since sanctions could ripple across the economy.Some top European allies of the U.S. have raised concerns about various options, warning that Russian President Vladimir Putin could retaliate by cutting off oil and gas supplies that are vital to their country.Europe gets as much as 40% of its gas from Russia, and countries like Germany could be left in the cold if Putin decides to end their supplies.What could sanctions against Russia look like?Here’s what we know:Putin a targetPutin and members of his inner circle could personally pay a price if Russia invades Ukraine.Two dozen Senate Democrats have filed legislation that would allow the Biden administration to block all U.S. property transactions and interests in property held by Putin and more than a dozen other top officials in Russia’s government and military if Russia invades. The White House quickly announced its support for the measure.Particularly irksome to Putin himself, the bill would require the U.S. State Department to issue a detailed report on Putin's personal net worth and his assets, along with those of his inner circle.A separate bill filed by Rep. Jim Banks, R-Ind., would ramp up sanctions against Putin now instead of waiting for an invasion.The measure, which is co-sponsored by 40 other House Republicans, urges the administration to consider sanctions for many in Russia’s upper echelon, including members of Putin’s family and the woman purported to be his longtime girlfriend, Alina Kabaeva, a former Olympic gymnast.Targeting a foreign leader personally would be unusual but not unprecedented. Two years ago, the Democratic-led House approved a biting sanctions bill that would have punished Turkish President Recep Tayyip Erdogan personally over Turkey’s assault on U.S.-allied Kurdish forces in Syria.The legislation, which stalled in the Senate, called for a public assessment of Erdogan’s net worth amid questions about his finances in Turkey.WHY IS PUTIN THREATENING UKRAINE? Respect, fear, power at play in Russian leader's motivationsMoving money around the worldOne of the toughest actions the Biden administration and its NATO allies could take against Russia would be to remove it from the SWIFT financial system that's used to transfer money from bank to bank around the globe. Kicking Russia out of the system would remove it from most international financial transactions, including international profits from oil and gas production, which account for more than 40% of the country’s revenue.The downside? The U.S. economy and those of its allies also could suffer, since it could discourage some Western banks from dealing with Russia, and Moscow could retaliate by cutting oil and gas exports.“The toughest stick won’t always ultimately be the most intelligent sword,” Annalena Baerbock, Germany’s foreign minister, told reporters in January.Reuters, quoting sources in the U.S. and Europe, reported last week that banning Russia from SWIFT is no longer on the table.RUSSIA-UKRAINE EXPLAINED: Inside the crisis as US, allies await next moveNord Stream 2Biden has vowed to stop the completed but not-yet-operational Nord Stream 2 gas pipeline from Russia to Germany if Russia invades Ukraine.The $11 billion undersea pipeline, a priority for Putin, would allow Russia to send gas to its customers in central and eastern Europe without using land routes that run through the Baltic states and Ukraine. Right now, Russia pays Ukraine around $2 billion a year in transit fees to send the gas through its lines.The pipeline was completed last year but is still awaiting final regulatory approval from Germany before it goes online.Biden vows that no gas will be allowed to flow through the pipeline if Russia invades Ukraine. But stopping the pipeline would require the cooperation of Germany. German Chancellor Olaf Scholz has said Germany and the U.S. “will act together” if Russia invades Ukraine but has stopped short of saying outright that it would agree to block Nord Stream 2.The Biden administration says it is working to secure energy supplies from other sources so that Russia's European customers can still get the gas they need if Nord Stream 2 is blocked.NORD STREAM 2: How the pipeline became a bargaining chip in the crisis between Russia and UkraineExport controlsThe Biden administration is considering imposing tough export control measures that could keep Russia from getting high-tech components used in smartphones, airplanes and automobiles.One option would be to add Russia to the most restrictive group of countries for export control purposes, together with Cuba, Iran, North Korea and Syria.That would mean Russia’s ability to obtain high-tech components would be severely restricted because virtually all semiconductors are designed with U.S. software and parts. The impact could extend to machine tools, smartphones, game consoles, tablets and televisions.Sanctions could also target critical Russian industry, including its defense and civil aviation sectors, which would hit Russia’s high-tech ambitions, whether in artificial intelligence or quantum computing.DEFENSIVE POSITIONS: Russians, Ukrainians wage fragile peace at Winter Olympics amid threat of warBETTER TRAINED, BETTER EQUIPPED: What you should know about Russia and Ukraine's militariesBlocking Russian access to US dollarsThe U.S. already holds one of the most powerful financial weapons to wield against Putin if he invades Ukraine – blocking Russia from access to the U.S. dollar.Dollars still dominate in financial transactions around the world, with trillions of dollars in play daily.Transactions in U.S. dollars ultimately are cleared through the Federal Reserve or through U.S. financial institutions. Crucially for Putin, that means foreign banks have to be able to access the U.S. financial system to settle dollar transactions.The ability to block that access gives the United States the ability to inflict financial pain well beyond its borders. Previously, the U.S. has suspended financial institutions from dollar clearing for allegedly violating sanctions against Iran, Sudan and other countries.WHAT WE KNOW: Lavrov advises Putin to continue diplomacy as Scholz heads to Kyiv, Moscow'FALSE FLAG': U.S. says Russia is developing video of fabricated attack as pretext for invading UkraineMichael Collins covers the White House. Follow him on Twitter @mcollinsNEWS.Contributing: The Associated Press",
        "publish_date": "2022-02-14 00:00:00",
        "timestamp_scraping": "2022/02/15 14:05:32"
    },
    {
        "url": "https://eu.usatoday.com/story/sports/nfl/columnist/bell/2022/02/14/sean-mcvay-learned-outcoached-bill-belichick-super-bowl/6781377001/",
        "url_source": "https://eu.usatoday.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Sean McVay demonstrated how much he’s grown since his first Super Bowl matchup | Opinion",
        "full_text": "Sean McVay demonstrated how much he’s grown since his first Super Bowl matchup | OpinionShow Caption Hide Caption Super Bowl LVI recap: Rams' Donald cements legendary legacy, Bengals fatal flaw dooms chances Jarrett Bell and Mike Jones share their biggest takeaways from Super Bowl LVI in Los Angeles and why the one mismatch everyone talked about ahead of the game ultimately decided it. USA TODAYINGLEWOOD, Calif. — Sean McVay can finally exhale.He’s now the youngest coach to win a Super Bowl, having turned 36 about three weeks ago. That historical distinction trumps being the youngest coach to have his own coaching tree.McVay, who lost in his first crack as a Super Bowl coach three years ago – he has said repeatedly that he was “outcoached” by Bill Belichick the last time – has crossed over to the other side.After the 23-20 nail-biter against the Cincinnati Bengals (coached by one his former assistants, Zac Taylor), someone asked McVay what it felt like to win the big one.He deflected a bit, making it about the team.“I think the biggest thing that I’ve realized about this group is that you’re reminded of your real purpose,” McVay said.Although McVay went on to express his deep love for individuals critical to the collective effort – players including Aaron Donald, Cooper Kupp, Odell Beckham, Jr., Von Miller and Andrew Whitworth – he’s obviously earned the right to take a bow.He just doesn’t seem so interested in that.“There’s really something powerful about being a part of something bigger than yourself,” he said.OPINION: Rams' wild Super Bowl victory over Bengals completes bold, all-in planSUPER BOWL TAKEAWAYS: Cooper Kupp comes through in the clutch, Rams put pressure on Joe BurrowNFL NEWSLETTER: Sign up now to get football news delivered to your inboxStill, as noble as it is to recognize the team, McVay is human, too. The pressure to win the Lombardi Trophy had to be enormous after the Rams swung for the fences with the “all-in” approach and had the fortune of playing Super Bowl LVI in their own stadium.Especially after the coach lauded for his offensive wizardry directed a unit that managed to score all of three points in that last Super Bowl.On Friday, two days before LVI, I asked McVay whether his nerves were testing him.“I don’t know until it gets closer,” he said.Then he talked about his players and their calmness and confidence.We can imagine his nerves during the course of Sunday’s tilt. The Rams scored touchdowns on two early possessions, but bungled a PAT exchange and blew a 10-point lead and spent most of the second half in comeback mode. With the momentum gone, they also had to deal with the loss of Beckham, who never returned after suffering a knee injury in the second quarter. And it seemed as though they might never recover from the sequence that opened the second half when Joe Burrow connected with Tee Higgins for a 75-yard TD on the first snap after halftime, then Matthew Stafford was intercepted on LA’s first snap of the third quarter, which set up a field goal that gave Cincinnati a 20-13 lead.“When you look at the way that second half started, a lot of teams would’ve folded,” McVay said. “I think the resilience was on display in a big way. You guys hear me talk about competitive greatness until I’m blue in the face. That was on display in a big way. Guys being at their best when their best was required.”The Rams sealed the victory with Donald forcing Burrow into a fourth-down incompletion, which followed a 15-play TD drive capped by Stafford’s 1-yard TD throw to Kupp.Sure, it was Donald who put on the rush for the game-clinching play. But McVay had fingerprints on it, too. Shortly before the play, McVay delivered a message during a sideline exchange with Donald: “You have to be relentless.”Donald recalled some history.“One thing I told him when he got here – before I had the opportunity to play for him and get to know him – I told him that as long as he’s here I want to continue to be a part of this organization and help build on the legacy,” Donald said. “We’re building a legacy.”Maybe Donald was dropping a hint as buzz circulated about whether he would retire after eight dominant seasons. The D-tackle wouldn’t commit to returning, saying he wanted to enjoy the championship moment.McVay, meanwhile, has been the source of speculation about his future, too. It seems doubtful that he would leave coaching and bolt to the TV booth at this point. But he’s certainly earned himself a raise from Rams owner Stan Kroenke.I had the chance to observe a slice of McVay during the build-up to LVI, serving as the pool reporter at Rams practices for the Pro Football Writers of America. Over the course of four days, I found him as you might expect: engaged, energetic, upbeat.Also, his eagerness for the task at hand was palatable.On Thursday, he ended a post-practice interview by exhorting, “Let’s get it on!”McVay also maintained during the week that he would allow game conditions dictate the approach. That’s understandable and reflective of his growth. In the Super Bowl 53 loss to the Patriots, the Rams didn’t have the answers or adjustments. McVay seemed determined not to let that happen this time.Case in point: The Rams rushed for just 43 yards on 23 carries (1.9 yards per rush) and on their final drive, Cam Akers was stuffed on third-and-1 from their 30-yard line. McVay decided to go for it. Kupp ran a jet sweep on fourth down and cut upfield for a 7-yard gain that kept the drive alive. McVay pretty much gambled the game on the fourth down. And won.“Sometimes, you go with a gut feel,” he said.Then McVay diverted the credit to Kupp.“Great player making a great play,” he said. “We don’t make that play, we’re not sitting up here talking about winning the game, that’s for sure.”They adjusted. And it worked. Just like McVay knew it could. He won big with a purpose.",
        "publish_date": "2022-02-14 00:00:00",
        "timestamp_scraping": "2022/02/15 14:05:40"
    },
    {
        "url": "https://eu.usatoday.com/story/sports/columnist/brennan/2022/02/14/kamila-valieva-cheat-drug-case-decision-2022-beijing-olympics/6781059001/",
        "url_source": "https://eu.usatoday.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "What a slap in the face the Kamila Valieva decision is for athletes who don't cheat | Opinion",
        "full_text": "What a slap in the face the Kamila Valieva decision is for athletes who don't cheat | OpinionShow Caption Hide Caption Russia's Kamila Valieva allowed to continue competing at the Games The Court of Arbitration for Sport ruled that Russian figure skater Kamila Valieva is allowed to continue competing at the Beijing Games. Sandy Hooper, USA TODAYRussia’s 15-year-old superstar Kamila Valieva tested positive for a banned drug less than two months agoMonday the Court of Arbitration for Sport ruled she is allowed to compete in the women's individual eventShe is favored to win gold in the women's competition after helping Russia win team gold last weekBEIJING – What a dark day this is for the Olympic Games and the thousands of athletes who play by the rules and do not cheat by taking performance-enhancing drugs.The Court of Arbitration for Sport has spoken, and it has made an awful decision: Russia’s 15-year-old superstar Kamila Valieva, who tested positive for a performance-enhancing drug less than two months ago, will be allowed to continue to compete in the Beijing Winter Olympics.She will be the overwhelming gold medal favorite in the women’s figure skating competition, which begins Tuesday and ends Thursday. She will likely leave these Games with two gold medals, one in the team competition and the other in her individual event.But she won’t get to receive them here. In another sign of just how much of a fiasco Russia has created and CAS has enabled, the IOC announced a few hours after the CAS decision Monday that there would be no medal ceremonies involving Valieva at these Games. No team ceremony, and if she’s in the top three, no women’s medal ceremony and no on-ice flower ceremony.NO MEDAL CEREMONY: IOC says it will not hold team figure skating event medal ceremonyCHASING GOLD: Get the best Olympic stories straight to your inbox with our newsletterTEXT WITH US: Get behind-the-scenes access to the Beijing Olympics over textCAS decision: Kamila Valieva is allowed to compete. What a dark day this is for the fight against doping in sports. — Christine Brennan (@cbrennansports) February 14, 2022The IOC even said a 25th woman would be allowed to participate in the long program, basically telegraphing its opinion that Valieva is radioactive and might well end up being disqualified later.While it’s a shame the Americans and the Japanese, who finished second and third respectively in the team competition behind the Russians, will not get a medal ceremony here at the Games, the IOC’s dramatic reaction is a stinging rebuke of Russia, and basically screams out: Russia’s cheating, even if CAS let them skate, literally and figuratively.It was a remarkable few hours at these Olympic Games. What a slap in the face the CAS decision was for every athlete everywhere who has done the right thing, who has asked to be tested more to prove they are not cheating, who have lived their lives for a level playing field, people like Katie Ledecky, Michael Phelps and Michelle Kwan.And what a devastatingly awful message this is to the Russians: Keep doping, especially your minor athletes. You’ll get away with it on a technicality every time.The Olympic Games lost today. Clean sport lost. Cheating won. Russia’s state-sponsored doping system won. The bad guys won.No matter how sympathetic one is to the plight of Valieva, the CAS decision is the wrong one. Now that they are allowing Valieva to compete, why don’t we welcome back Ben Johnson, Marion Jones and Lance Armstrong with open arms? Valieva is no doubt a pawn in Russia’s awful system of abuse, lies and denial, but the fact is she tested positive for a banned performance-enhancing drug less than two months ago. That’s the very definition of cheating.When we think of the names Johnson, Jones and Armstrong, we think of drug cheats who eventually received their comeuppance. Track and field has never quite been the same since Johnson, then Jones. And cycling? Armstrong’s defense was that everyone was cheating, which is quite a sales pitch to attract new fans.Even though those three scoundrels were tossed out of their sports, a cloud remained: if you can’t trust what you’re watching, why watch?This is now the challenge facing these star-crossed, controversy-laden Beijing Olympics. A woman who was just caught doping could leave the Games as one of its biggest stars. Chinese Olympic officials must just be thrilled. Theirs are now a tainted Games, forevermore.The decision to allow her to skate in the women’s event, and her likely victory, will be a stain on these Games and the reputation of the Olympic movement that will be impossible to remove.It’s natural to have two conflicting thoughts on the status of this 15-year-old: sadness and anger on her behalf for what the adults in her life did to her, and even more sadness and anger about a decision allowing someone who used an illegal substance to continue to compete in these Games.You can feel sorry for Valieva and still know that the CAS decision is wrong, very wrong.Strip down all the confusing particulars of this case and the essential question was this: Are you in favor of doping? Or are you not?CAS gave an epically wrong answer.",
        "publish_date": "2022-02-14 00:00:00",
        "timestamp_scraping": "2022/02/15 14:05:48"
    },
    {
        "url": "https://eu.usatoday.com/videos/life/militarykind/2022/02/07/siblings-shock-mom-unexpected-lunch-date/6695331001/",
        "url_source": "https://eu.usatoday.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Siblings shock mom with an unexpected lunch date",
        "full_text": "Siblings shock mom with an unexpected lunch dateDenise Dukes Felder of Cincinnati, Ohio, gets a lunchtime surprise when her son, Air Force Sergeant Jeffrey Felder Jr., returns from Saudi Arabia.Militarykind, USA TODAY",
        "publish_date": "2022-02-07 00:00:00",
        "timestamp_scraping": "2022/02/15 14:06:46"
    },
    {
        "url": "https://seekingalpha.com/comparison?source=content_type%253Areact%257Csource%253Asecondarytabs",
        "url_source": "https://seekingalpha.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Key Stats Comparison",
        "full_text": "To ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.If you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:07:26"
    },
    {
        "url": "https://seekingalpha.com/screeners/940d0c9cca-Very-Bullish-Stocks-With-Short-Squeeze-Potential?source=content_type%253Areact%257Csource%253Asecondarytabs",
        "url_source": "https://seekingalpha.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Stock Screener",
        "full_text": "To ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.If you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:07:34"
    },
    {
        "url": "https://seekingalpha.com/performance/quant?source=content_type%253Areact%257Csource%253Asecondarytabs",
        "url_source": "https://seekingalpha.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Quant Rating Market Performance and Backtest",
        "full_text": "Seeking Alpha's Strong Buy quant recommendations represent the culmination of powerful computer processing and ‘Quantamental’ analysis. The backtest trading strategy shows the effectiveness of our autonomous Strong Buy stock selection model.From nearly all U.S. securities, our quantitative systematic trading algorithm selects our finest Strong Buy recommendations. These stocks possess the strongest collective attributes of value, growth, profitability, EPS Revisions, and stock price momentum.Over the last 10-years, the backtested strategy has proven to yield impressive returns compared to the S&P 500. Beating the market 9 out of 10 years.In December 2018, Seeking Alpha acquired CressCap Investment Research, a platform providing next-generation quantitative analytics. Founder and CEO of CressCap, Steven Cress, joined Seeking Alpha as Head of Quant Strategies to oversee the growth and strategic development of new quantitative offerings for investors.The addition of CressCap Investment Research to Seeking Alpha means through futuristic quantitative modeling, investors can expect unbiased investment research wrapped up in autonomous stock ratings and investment recommendations. The platform now provides consumers with easy access to Strong Buy quant recommendations. Seeking Alpha’s quant ratings are derived by measuring a stock's financial metrics against other stocks in the sector on the basis of value, growth, profitability, momentum and analysts’ earnings revisions. The metrics are assigned factor grades that are then weighted to maximize the predictive value. Stocks with the best ratings are awarded Strong Buy recommendations.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:07:44"
    },
    {
        "url": "https://seekingalpha.com/earnings/top-movers-earnings?source=content_type%253Areact%257Csource%253Asecondarytabs",
        "url_source": "https://seekingalpha.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Top Movers on Earnings",
        "full_text": "By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Cookie Policy",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:07:53"
    },
    {
        "url": "https://seekingalpha.com/sitemap?source=content_type%253Areact%257Csource%253Asecondarytabs",
        "url_source": "https://seekingalpha.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Sitemap",
        "full_text": "By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Cookie Policy",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:08:02"
    },
    {
        "url": "https://seekingalpha.com/market-outlook/gold-and-precious-metals?source=content_type%253Areact%257Csource%253Asecondarytabs",
        "url_source": "https://seekingalpha.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Gold & Precious Metals",
        "full_text": "To ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.If you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:08:10"
    },
    {
        "url": "https://seekingalpha.com/stock-ideas/quick-picks?source=content_type%253Areact%257Csource%253Asecondarytabs",
        "url_source": "https://seekingalpha.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Quick Stock Picks & Lists",
        "full_text": "To ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.If you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:08:18"
    },
    {
        "url": "https://seekingalpha.com/etfs-and-funds/etf-tables/emerging_markets?source=content_type%253Areact%257Csource%253Asecondarytabs",
        "url_source": "https://seekingalpha.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Emerging Market ETFs",
        "full_text": "By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Cookie Policy",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:08:26"
    },
    {
        "url": "https://seekingalpha.com/etfs-and-funds/etf-tables/sectors?source=content_type%253Areact%257Csource%253Asecondarytabs",
        "url_source": "https://seekingalpha.com/",
        "language": "en",
        "title_from_source": "null",
        "title_from_page": "Sector ETFs",
        "full_text": "By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Cookie Policy",
        "publish_date": "null",
        "timestamp_scraping": "2022/02/15 14:08:33"
    }
]